<a href="https://colab.research.google.com/github/s23912/pad_practicals/blob/main/pad_w_02.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

In [ ]:
import json # to lad json files

In [ ]:
import csv

In [ ]:
path='/content/drive/MyDrive/DS/PAD/PAD_02/cust_list.csv'
path2='/content/drive/MyDrive/DS/PAD/PAD_02/cust_dict.txt'

In [ ]:
with open(path, newline='') as cf:
  spr = csv.reader(cf, delimiter=';', quotechar='|')
  for row in spr:
    print('* '.join(row))

k1* k2* k3* h4
Tom* 22* True* ih234
Ana* 44* False* jh665
Max* 55* True* kl455
* * * uo999

In [ ]:
with open(path, newline='') as cf2:
  re = csv.DictReader(cf2)
  for row in re:
    print(row['k1'], row['k2'])
  # jaki rodziaj pliku mozna w ten sposób wczytywać , czy słownik? 
  # jesli tak to jak zapisać kolumny 
  # co oznaczają klucz: wartość w ssv , czy klucz to nazwa kolumny ? jesli tak to czemu nie działa

KeyError: ignored

In [ ]:
!sudo apt-get install mysql-connector-python
!pip install mysql-connector-python

Reading package lists... Done
Building dependency tree
Reading state information... Done
E: Unable to locate package mysql-connector-python
Collecting mysql-connector-python
  Downloading mysql_connector_python-8.0.27-1commercial-cp37-cp37m-manylinux1_x86_64.whl (37.5 MB)
     |████████████████████████████████| 37.5 MB 58 kB/s
Requirement already satisfied: protobuf>=3.0.0 in /usr/local/lib/python3.7/dist-packages (from mysql-connector-python) (3.17.3)
Requirement already satisfied: six>=1.9 in /usr/local/lib/python3.7/dist-packages (from protobuf>=3.0.0->mysql-connector-python) (1.15.0)
Installing collected packages: mysql-connector-python
Successfully installed mysql-connector-python-8.0.27

In [ ]:
import mysql.connector
# jakas ksiazka do best practise pracy na bazach lub dumpach

In [ ]:
#PANDAS

In [ ]:
import numpy as np
import pandas as pd

l=[x for x in range(1,11)]
index =['a','b','c','d','e','f','g','h','i','j']
dic=dict(zip(index,l))
series_from_list = pd.Series(l,index)
series_from_dict = pd.Series(dic)
print(series_from_dict)
print(series_from_list)

a     1
b     2
c     3
d     4
e     5
f     6
g     7
h     8
i     9
j    10
dtype: int64
a     1
b     2
c     3
d     4
e     5
f     6
g     7
h     8
i     9
j    10
dtype: int64

In [ ]:
names =['T','A','B','C']
years =[22,55,66,77]
numbers=[5677,666,6666,3224]
all ={'years':years,
      'numbers':numbers}
df = pd.DataFrame(all, index=names)
df

   years  numbers
T     22     5677
A     55      666
B     66     6666
C     77     3224

In [ ]:
import pandas as pd
names2 =['T','A','B','C']
years2 =[22,55,66,77]
numbers2=[5677,666,6666,3224]
all ={'names':names2,
      'years':years2,
      'numbers':numbers2}
df2 = pd.DataFrame(all)
df2

  names  years  numbers
0     T     22     5677
1     A     55      666
2     B     66     6666
3     C     77     3224

In [ ]:
import pandas as pd
all3 ={'kol1':['T','A','B','C'],'kol2': [22,55,66,77],'kol3' :[5677,666,6666,3224]}
df3 = pd.DataFrame(all3)
df3

  kol1  kol2  kol3
0    T    22  5677
1    A    55   666
2    B    66  6666
3    C    77  3224

In [ ]:
print(df3['kol1'])

0    T
1    A
2    B
3    C
Name: kol1, dtype: object

In [ ]:
print(df3.loc[1]['kol2'])

55

In [ ]:
df3['kol4']=df3['kol2']*5
df3

  kol1  kol2  kol3  kol4
0    T    22  5677   110
1    A    55   666   275
2    B    66  6666   330
3    C    77  3224   385

In [ ]:
del(df3['kol4'])
df3

  kol1  kol2  kol3
0    T    22  5677
1    A    55   666
2    B    66  6666
3    C    77  3224

In [ ]:
df3.sum()

kol1     TABC
kol2      220
kol3    16233
dtype: object

In [ ]:
df3.sum(1)

0    5699
1     721
2    6732
3    3301
dtype: int64

In [ ]:
df3.describe()

            kol2         kol3
count   4.000000     4.000000
mean   55.000000  4058.250000
std    23.762716  2684.774649
min    22.000000   666.000000
25%    46.750000  2584.500000
50%    60.500000  4450.500000
75%    68.750000  5924.250000
max    77.000000  6666.000000

In [ ]:
#timery 
from datetime import date

today = date.today()
print('today is ', today)

yesterday = 2021-11-10
print('----------')
all4 ={'kol1':['T','A','B'],'kol2': ['1985-03-24', '1990-04-24','2000-01-01']}
df4 = pd.DataFrame(all4)
print(df4)
print('----------')
print(df4['kol2'])
print('----------')
df4['kol2']=pd.to_datetime(df4['kol2'])
print(df4['kol2'])

today is  2021-11-11
----------
  kol1        kol2
0    T  1985-03-24
1    A  1990-04-24
2    B  2000-01-01
----------
0    1985-03-24
1    1990-04-24
2    2000-01-01
Name: kol2, dtype: object
----------
0   1985-03-24
1   1990-04-24
2   2000-01-01
Name: kol2, dtype: datetime64[ns]

In [ ]:
!pip3 install python-dateutil

Requirement already satisfied: python-dateutil in /usr/local/lib/python3.7/dist-packages (2.8.2)
Requirement already satisfied: six>=1.5 in /usr/local/lib/python3.7/dist-packages (from python-dateutil) (1.15.0)

In [ ]:
import datetime
from dateutil.relativedelta import relativedelta
def getAge (birth):
  time_difference = relativedelta(today,birth)
  difference_in_years = time_difference.years
  return difference_in_years 


df4['age'] = df4['kol2'].apply(getAge)
df4

  kol1       kol2  age
0    T 1985-03-24   36
1    A 1990-04-24   31
2    B 2000-01-01   21

In [ ]:
#open fucntion
path4='/content/drive/MyDrive/DS/PAD/PAD_02/some_strings.txt'
myfile = open(path4, 'r')
myread = myfile.read()
myfile.close()
print(myread)

1 lorem ipsum lorem ipsum lorem ipsum
2lorem ipsum lorem ipsum lorem ipsum
3lorem ipsum lorem ipsum lorem ipsum
4lorem ipsum lorem ipsum lorem ipsum
5lorem ipsum lorem ipsum lorem ipsum
6lorem ipsum lorem ipsum lorem ipsum
7lorem ipsum lorem ipsum lorem ipsum

In [ ]:
with open(path4,'r') as myfile2:
  myread2 = myfile2.read()
print(myread2)

1 lorem ipsum lorem ipsum lorem ipsum
2lorem ipsum lorem ipsum lorem ipsum
3lorem ipsum lorem ipsum lorem ipsum
4lorem ipsum lorem ipsum lorem ipsum
5lorem ipsum lorem ipsum lorem ipsum
6lorem ipsum lorem ipsum lorem ipsum
7lorem ipsum lorem ipsum lorem ipsum

In [ ]:
with open(path4,'w') as myfile3:
  newcontent = myfile3.write('tekst1')
  print('tekst2', file=myfile3)

In [ ]:
with open(path4,'r') as myfile3:
  print(myfile3.read())

tekst1tekst2

In [ ]:
import csv

In [ ]:
path5='/content/drive/MyDrive/DS/PAD/PAD_02/cust_list.csv'
with open(path5, 'r') as csf:
  dict_reader = csv.DictReader(csf, delimiter=';')
  print(next(dict_reader))

OrderedDict([('k1', 'Tom'), ('k2', '22'), ('k3', 'True'), ('h4', 'ih234')])

In [ ]:
with open(path5, 'r') as csf:
  dict_reader = csv.DictReader(csf, delimiter=';')
  #print(dict(next(dict_reader)))
  #print(dict(next(dict_reader)))
  #print(dict(next(dict_reader)))
  #print(dict(next(dict_reader)))
  for row in dict_reader:
    print(dict(row))

{'k1': 'Tom', 'k2': '22', 'k3': 'True', 'h4': 'ih234'}
{'k1': 'Ana', 'k2': '44', 'k3': 'False', 'h4': 'jh665'}
{'k1': 'Max', 'k2': '55', 'k3': 'True', 'h4': 'kl455'}
{'k1': '', 'k2': '', 'k3': '', 'h4': 'uo999'}

In [ ]:
import pandas as pd
df6 = pd.read_csv(path5, sep=';')
df6

    k1    k2     k3     h4
0  Tom  22.0   True  ih234
1  Ana  44.0  False  jh665
2  Max  55.0   True  kl455
3  NaN   NaN    NaN  uo999

In [ ]:
df6['k1']

0    Tom
1    Ana
2    Max
3    NaN
Name: k1, dtype: object

In [ ]:
df6.loc[1,['k2','k3']]

k2       44
k3    False
Name: 1, dtype: object

In [ ]:
df6.iloc[1,1:3]

k2       44
k3    False
Name: 1, dtype: object

In [ ]:
#fancy indexing
df6[df6['k2']>40]

    k1    k2     k3     h4
1  Ana  44.0  False  jh665
2  Max  55.0   True  kl455

In [ ]:
#braki danych
df6['k2']=df6['k2'].fillna(df6['k2'].mean())
df6

    k1         k2     k3     h4
0  Tom  22.000000   True  ih234
1  Ana  44.000000  False  jh665
2  Max  55.000000   True  kl455
3  NaN  40.333333    NaN  uo999

In [ ]:
#braki danych
df6['k3'].fillna(df6['k3'].mean())

0        True
1       False
2        True
3    0.666667
Name: k3, dtype: object

In [ ]:
# imputacja - zastępowanie wartości na za pomoca specjalnie do tego wytrenowanego modelu

In [ ]:
df7 = df6.drop(columns =['h4'], axis=1)
df7

    k1         k2     k3
0  Tom  22.000000   True
1  Ana  44.000000  False
2  Max  55.000000   True
3  NaN  40.333333    NaN

In [ ]:
#grupowanie 
df6.groupby(by='k3')['k2'].mean()
#df6.groupby(by='k3')['k2','inna_kolumna'].mean() przykład dla wielu kolumn

k3
False    44.0
True     38.5
Name: k2, dtype: float64

In [ ]:
#tabela przestawna
pd.pivot_table(df6, values='k2',index='k3')

         k2
k3
False  44.0
True   38.5